1c_um/src/InformationRegisters/ум_ЛогФоновыхЗаданийПакетов/ум_ЛогФоновыхЗаданийПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ум_ЛогФоновыхЗаданийПакетов</name>
  <resources>
    <name>Вид</name>
    <type>
      <types>EnumRef.ум_ВидыФЗПакетовДанных</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторРодительскогоФЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособОбработкиПакетов</name>
    <type>
      <types>CatalogRef.ум_СпособыОбработкиПакетов</types>
    </type>
  </resources>
  <attributes>
    <name>ДанныеСобытия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторФЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВременнаяМеткаСобытия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>EnumRef.ум_ЛогированиеСобытийФЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1c_um/src/Enums/ум_ЛогированиеСобытийФЗ/ум_ЛогированиеСобытийФЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ум_ЛогированиеСобытийФЗ</name>
  <enumValues>
    <name>Старт</name>
  </enumValues>
  <enumValues>
    <name>Окончание</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

1c_um/src/Enums/ум_СостоянияПакетаДанных/ум_СостоянияПакетаДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ум_СостоянияПакетаДанных</name>
  <enumValues>
    <name>ВОбработке</name>
  </enumValues>
  <enumValues>
    <name>КОбработке</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

1c_um/src/CommonModules/ум_ЛогированиеПакетыДанных/Module.bsl
#Область ПрограммныйИнтерфейс

// Универсальная процедура записи события в лог.
//
// Параметры:
//  ИдентификаторФЗ              - УникальныйИдентификатор, Строка - Идентификатор текущего потока/задания.
//  Событие                      - ПеречислениеСсылка.ум_СобытияЛогаФЗ - Что произошло (Старт, Успех, Ошибка и т.д.).
//  Вид                          - ПеречислениеСсылка.ум_ВидыФЗПакетовДанных - Регламентное, Управляющее или Рабочее.
//  ИдентификаторРодительскогоФЗ - УникальныйИдентификатор, Строка - Идентификатор запустившего ФЗ.
//  СпособОбработкиПакетов       - СправочникСсылка.ум_СпособыОбработкиПакетов - Контекст обработки.
//  ДанныеСобытия                - Структура, Соответствие, Строка - Структурированные параметры для сериализации в JSON или готовая строка.
//
Процедура ЗаписатьСобытие(Знач ИдентификаторФЗ, Знач Событие, Знач Вид, 
                          Знач ИдентификаторРодительскогоФЗ = Неопределено, 
                          Знач СпособОбработкиПакетов = Неопределено, 
                          Знач ДанныеСобытия = Неопределено,
						  Знач ВременнаяМеткаСобытия = 0) Экспорт
						  
	ПараметрыУдаленияЛоговФЗ = ум_ПакетыДанныхПовтИсп.ПолучитьНастройкиЛогированияФЗ(); 
	Если ПараметрыУдаленияЛоговФЗ.ЛогированиеФЗ = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	// Подготовка ключей (приведение УИД к строке, если используется Строка(36) в БД)
	СтрокаИдентификаторФЗ = Строка(ИдентификаторФЗ);
	
	СтрокаРодительскийФЗ = "";
	Если ЗначениеЗаполнено(ИдентификаторРодительскогоФЗ) Тогда
		СтрокаРодительскийФЗ = Строка(ИдентификаторРодительскогоФЗ);
	КонецЕсли;

	// Создаем набор записей БЕЗ отбора. 
	// При Записать(Ложь) платформа выполнит чистый INSERT (добавление).
	Набор = РегистрыСведений.ум_ЛогФоновыхЗаданийПакетов.СоздатьНаборЗаписей();
	
	// Отключаем лишние проверки платформы и обмен данными для скорости
	Набор.ОбменДанными.Загрузка = Истина;
	
	НоваяЗапись = Набор.Добавить();
	
	// Измерения (формируют уникальность записи)
	НоваяЗапись.ИдентификаторФЗ       = СтрокаИдентификаторФЗ; 
	
	Если ВременнаяМеткаСобытия = 0 Тогда
		ВременнаяМеткаСобытия = ТекущаяУниверсальнаяДатаВМиллисекундах();	
	КонецЕсли;
	
	НоваяЗапись.ВременнаяМеткаСобытия = ВременнаяМеткаСобытия;
	
	// Ресурсы
	НоваяЗапись.Событие                      = Событие;
	НоваяЗапись.Вид                          = Вид;
	НоваяЗапись.ИдентификаторРодительскогоФЗ = СтрокаРодительскийФЗ;
	
	НоваяЗапись.ДанныеСобытия = СериализоватьДанныеСобытияВJSON(ДанныеСобытия);
	
	Если ЗначениеЗаполнено(СпособОбработкиПакетов) Тогда
		НоваяЗапись.СпособОбработкиПакетов = СпособОбработкиПакетов;
	КонецЕсли;
	
	Попытка
		Набор.Записать(Ложь); 
	Исключение
		ТекстИсключения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("ум_ЛогированиеПакетыДанных.ОшибкаЗаписиВРегистр",
			УровеньЖурналаРегистрации.Ошибка,,, ТекстИсключения + Символы.ПС);
	КонецПопытки;

КонецПроцедуры  

// Получает уникальный идентификатор текущего фонового задания.
// Если код выполняется не в фоне, генерирует новый уникальный идентификатор.
// 
// Возвращаемое значение:
//  УникальныйИдентификатор - Идентификатор текущего задания.
Функция УникальныйИдентификаторТекущегоФЗ() Экспорт
	Перем ИдентификаторФЗ;
	Сеанс = ПолучитьТекущийСеансИнформационнойБазы();
	ТекущееФЗ = Сеанс.ПолучитьФоновоеЗадание();
	
	Если ТекущееФЗ <> Неопределено Тогда
		ИдентификаторФЗ = ТекущееФЗ.УникальныйИдентификатор;
	Иначе
		// вручную из обычного толстого/тонкого клиента, а не в фоне.
		ИдентификаторФЗ = Новый УникальныйИдентификатор();
	КонецЕсли;	 
	Возврат ИдентификаторФЗ; 
КонецФункции

// Записывает событие старта выполнения.
//
// Параметры:
//  ИдентификаторФЗ              - УникальныйИдентификатор, Строка - Идентификатор текущего потока/задания.
//  Вид                          - ПеречислениеСсылка.ум_ВидыФЗПакетовДанных - Регламентное, Управляющее или Рабочее.
//  ИдентификаторРодительскогоФЗ - УникальныйИдентификатор, Строка - Идентификатор запустившего ФЗ.
//  СпособОбработкиПакетов       - СправочникСсылка.ум_СпособыОбработкиПакетов - Контекст обработки.
//  ДанныеСобытия                - Структура, Соответствие, Строка - Структурированные параметры.
Процедура ЗаписатьСтарт(Знач ИдентификаторФЗ, Знач Вид, Знач ИдентификаторРодительскогоФЗ = Неопределено, Знач СпособОбработкиПакетов = Неопределено, Знач ДанныеСобытия = Неопределено) Экспорт
	
	ЗаписатьСобытие(ИдентификаторФЗ, 
	                Перечисления.ум_ЛогированиеСобытийФЗ.Старт, // Замени на актуальное значение твоего перечисления
	                Вид, 
	                ИдентификаторРодительскогоФЗ, 
	                СпособОбработкиПакетов,
					ДанныеСобытия);
	
КонецПроцедуры

// Записывает событие успешного завершения выполнения.
//
// Параметры:
//  ИдентификаторФЗ              - УникальныйИдентификатор, Строка - Идентификатор текущего потока/задания.
//  Вид                          - ПеречислениеСсылка.ум_ВидыФЗПакетовДанных - Регламентное, Управляющее или Рабочее.
//  ИдентификаторРодительскогоФЗ - УникальныйИдентификатор, Строка - Идентификатор запустившего ФЗ.
//  СпособОбработкиПакетов       - СправочникСсылка.ум_СпособыОбработкиПакетов - Контекст обработки.
//  ДанныеСобытия                - Структура, Соответствие, Строка - Структурированные параметры.
Процедура ЗаписатьОкончание(Знач ИдентификаторФЗ, Знач Вид, Знач ИдентификаторРодительскогоФЗ = Неопределено, Знач СпособОбработкиПакетов = Неопределено, Знач ДанныеСобытия = Неопределено, Знач ВременаяМетка = 0) Экспорт
	
	ЗаписатьСобытие(ИдентификаторФЗ, 
	                Перечисления.ум_ЛогированиеСобытийФЗ.Окончание, 
	                Вид, 
	                ИдентификаторРодительскогоФЗ, 
	                СпособОбработкиПакетов,
					ДанныеСобытия,
					ВременаяМетка);
	
КонецПроцедуры

// Обработчик пакета очистки логов фоновых заданий.
// 
// Параметры:
//  МассивИДПакетов           - Массив    - Массив идентификаторов обрабатываемых пакетов.
//  ПараметрыПакетаДанных     - Структура - Параметры пакета (ожидается свойство "ДатаУдаления").
//  ПараметрыСпособаОбработки - Структура - Параметры способа обработки пакетов.
//
// Возвращаемое значение:
//  Структура - содержит СостояниеПакетаДанных (ПеречислениеСсылка.ум_СостоянияПакетаДанных) и Сообщение (Строка).
Функция СпособОбработкиОчисткаЛоговФЗ(ДанныеПакета,
                                      ПараметрыПакетаДанных = Неопределено,
                                      ПараметрыСпособаОбработки = Неопределено) Экспорт
									  
	ДатаУдаления = Неопределено;
	Если ТипЗнч(ДанныеПакета) = Тип("Структура") И ДанныеПакета.Свойство("ДатаУдаления") Тогда
		ДатаУдаления = ДанныеПакета.ДатаУдаления;     
		Если ЗначениеЗаполнено(ДатаУдаления) Тогда
			ОчиститьЛог(ДатаУдаления);
		КонецЕсли; 
		Возврат Новый Структура("СостояниеПакетаДанных, Сообщение", Перечисления.ум_СостоянияПакетаДанных.Обработан, "");
	Иначе
		ТекстСообщения = "Неожиданные входящие данные.";
		Возврат Новый Структура("СостояниеПакетаДанных, Сообщение", Перечисления.ум_СостоянияПакетаДанных.Ошибка, ТекстСообщения);
	КонецЕсли;    	
	
КонецФункции

// Десериализует данные события из лога обратно в структуру параметров.
// Поддерживает обратную совместимость: если строка не в формате JSON (старый лог), 
// помещает всю строку в "ТекстКомментария" и пытается извлечь метрику обработанных пакетов.
// 
// Параметры:
//  СтрокаДанных - Строка - Данные из лога (формат JSON или старая строка).
//
// Возвращаемое значение:
//  Структура - Разобранные параметры (ЗапущеноФЗ, ОбработаноПакетов, ТекстКомментария и др.).
Функция РазобратьДанныеСобытия(Знач СтрокаДанных) Экспорт
	
	ПараметрыСобытия = Новый Структура("ЗапущеноФЗ, ОбработаноПакетов, ТекстКомментария", 0, 0, "");
	
	Если ПустаяСтрока(СтрокаДанных) Тогда
		Возврат ПараметрыСобытия;
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаДанных);
	
	ПрочитанныеДанные = Неопределено;
	Попытка
		ПрочитанныеДанные = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		// Строка не является валидным JSON, ПрочитанныеДанные останется Неопределено
	КонецПопытки;
	ЧтениеJSON.Закрыть();
	
	Если ТипЗнч(ПрочитанныеДанные) = Тип("Структура") Или ТипЗнч(ПрочитанныеДанные) = Тип("Соответствие") Тогда
		Для Каждого Элемент Из ПрочитанныеДанные Цикл
			ПараметрыСобытия.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;
	Иначе
		// Обратная совместимость с неформатированным текстом
		ПараметрыСобытия.ТекстКомментария = СтрокаДанных;
		Если Найти(СтрокаДанных, "Количество выполненных пакетов") > 0 Тогда
			СтрокаЧисла = СтрЗаменить(СтрокаДанных, "Количество выполненных пакетов", "");
			СтрокаЧисла = СтрЗаменить(СтрокаЧисла, " ", "");
			Попытка
				ПараметрыСобытия.ОбработаноПакетов = Число(СтрокаЧисла);
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПараметрыСобытия;
	
КонецФункции
 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СериализоватьДанныеСобытияВJSON(Знач ДанныеСобытия)
	
	ТипДанныхСобытия = ТипЗнч(ДанныеСобытия);
	Если ТипДанныхСобытия = Тип("Структура") Или ТипДанныхСобытия = Тип("Соответствие") Тогда
		ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет);
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);
		ЗаписатьJSON(ЗаписьJSON, ДанныеСобытия);
		Возврат ЗаписьJSON.Закрыть();
	ИначеЕсли ТипДанныхСобытия = Тип("Строка") Тогда
		Возврат ДанныеСобытия;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

// Очищает старые записи лога фоновых заданий до указанной даты включительно.
//
// Параметры:
//  ДатаПо - Дата - Дата (в локальном времени сеанса), по которую включительно нужно удалить логи.
Процедура ОчиститьЛог(Знач ДатаПо)     
	
	Если Не ЗначениеЗаполнено(ДатаПо) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ум_ЛогФоновыхЗаданийПакетов.ИдентификаторФЗ КАК ИдентификаторФЗ,
		|	ум_ЛогФоновыхЗаданийПакетов.ВременнаяМеткаСобытия КАК ВременнаяМеткаСобытия,
		|	ум_ЛогФоновыхЗаданийПакетов.Событие КАК Событие
		|
		|ИЗ
		|	РегистрСведений.ум_ЛогФоновыхЗаданийПакетов КАК ум_ЛогФоновыхЗаданийПакетов
		|ГДЕ
		|	ум_ЛогФоновыхЗаданийПакетов.ВременнаяМеткаСобытия <= &МеткаВремениПо";
	
	Запрос.УстановитьПараметр("МеткаВремениПо", ум_ПакетыДанныхОбщегоНазначения.ДатаВМеткуВремениUTC(КонецДня(ДатаПо)));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НаборУдалить = РегистрыСведений.ум_ЛогФоновыхЗаданийПакетов.СоздатьНаборЗаписей();
	НаборУдалить.ОбменДанными.Загрузка = Истина;
	
	Пока Выборка.Следующий() Цикл
		ЗаписьУдалить = НаборУдалить.Добавить();
		ЗаписьУдалить.ИдентификаторФЗ = Выборка.ИдентификаторФЗ;
		ЗаписьУдалить.ВременнаяМеткаСобытия = Выборка.ВременнаяМеткаСобытия;
		ЗаписьУдалить.Событие = Выборка.Событие;
	КонецЦикла;

	Если НаборУдалить.Количество() > 0 Тогда
		НаборУдалить.Записать(РежимЗамещения.Удаление);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
